
// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Clover_title" = "Clover EFI";
"Clover_description" = "Clover EFI richiede tre file essenziali. (in semplici termini)
boot0 (Sul disco MBR) responsabile del caricamento del boot1.
boot1 (Settore di avvio della partizione) per trovare il boot2.
boot2 (Nella cartella principale della partizione) per caricare /EFI/BOOT/CLOVERIA32.efi o CLOVERX64.efi, e il kernel etc.";

"boot0_title" = "1. BIOS MBR boot0 (HFS+Fat32)";
"boot0_description" = "Usato per l'avvio da BIOS nelle schede madri con BIOS.
Usa fdisk440 per installare il boot0 nei primi 440 bits del MBR senza alterare l'installazione Windows se possedute, quindi boot0 cercheràa la prima partizione HFS attiva per boot1h2, o cercherà nella prima partizione attiva Fat32 per il boot1f32alt.
Se questo è selezionato la partizione HFS e Fat32 saranno attivate.
Bisogna formattare come Fat32 in Win o Mac nel seguente modo.
  1. Prima cancellare come MS-DOS (FAT) da Utilità Disco.
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"boot0hfs_title" = "1. BIOS MBR boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "Usato per l'avvio da BIOS nelle schede madri con BIOS.
Usa fdisk440 per installare il boot0 nei primi 440 bits del MBR senza inibire precedenti installazioni di Windows se possedute, quindi boot0 cercherà la prima partizione HFS attiva per boot1h2, o cercherà nela prima partizione attiva Fat32 per il boot1f32alt.
Se non si seleziona questo,la partizione HFS sarò attivata, però se è selezionata la partizione Fat32 sarà questa ad essere attivata.
Bisogna formattare come Fat32 in Win o Mac nel seguente modo.
  1. Prima cancellare come MS-DOS (FAT) da Utilità Disco.
  2. diskutil list
  3. diskutil unmount /dev/rdisk9s1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdisk9s1
  5. diskutil mount /dev/rdisk9s1";

"boot0EFI_title" = "1. BIOS GPT EFI (HFS+Fat32)";
"boot0EFI_description" = "Usato per l'avvio da BIOS nelle schede madri con BIOS.
Usa fdisk440 para instalar boot0 en el primer 440 bits del MBR senza inibire precedenti installazioni di Windows se possedute, quindi boot0hfs cercherà la prima partizione GPT EFI boot1h2 o boot1f32alt.
Questo non setta la partizione selezionata come attiva.
Prima bisogna formattare la partizione EFI come HFS nel Mac, con i seguenti comandi.
  diskutil list
  newfs_hfs -v EFI /dev/rdisk9s1
O prima formattare EFI come Fat32 nel Mac, nel seguente modo.
  diskutil list
  newfs_msdos -v EFI -F 32 /dev/rdisk9s1";

"boot1no_title" = "1. Solo decomprimere";
"boot1no_description" = "Usato per avviare BIOS nelle schede madri con BIOS.
Non installare nessuno dei seguenti file: boot0 , boot0hfs, boot0md, boot1h2 e boot1f32alt, utilizzato per dischi rigidi 4kb con installazione manuale.";

"boot1UEFI_title" = "1. Avvio UEFI (Per schede madri con UEFI)";
"boot1UEFI_description" = "Usato per avviare UEFI nelle schede madri con UEFI.
Non installare nessuno dei seguenti file: boot0 , boot0hfs, boot0md, boot1h2 e boot1f32alt
Questa  opzione installa alcuni drivers in /EFI/drivers32, /EFI/drivers64 e /EFI/drivers64UEFI per l'avvio UEFI.
Bisogna configurare l'avvio UEFI (Nel Bios o nella Shell) :
UEFI -> /EFI/BOOT/CloverX64.efi -> boot.efi -> OS X";

"boot32_title" = "2. Installa e avvia prima in 32bit";
"boot32_description" = "Installa i file di avvio e configura che l'avvio sia prima a 32bit.
Avvio di base ------------ = Clover EFI 32bit. Tu puoi...
Premi il tasto 1 per boot1 = Chameleon boot,
Premi il tasto 3 per boot3 = Clover EFI 32bit boot,
Premi il tasto 6 per boot6 = Clover EFI 64bit boot.";

"boot64_title" = "2. Installa e avvia prima in 64bit";
"boot64_description" = "Installa i file di avvio e configura che l'avvio sia prima a 64bit.
Avvio di base ------------ = Clover EFI 64bit. Tu puoi...
Premi il tasto 1 per boot1 = Chameleon boot,
Premi il tasto 3 per boot3 = Clover EFI 32bit boot,
Premi il tasto 6 per boot6 = Clover EFI 64bit boot.";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "Temi";
"Themes_description" = "Seleziona per installare i temi.";

"black_green_title" = "black_green";
"black_green_description" = "Tema di base black_green di Blackosx,
Installa in /EFI/BOOT/themes/black_green.";

"AppleStyle_title" = "AppleStyle";
"AppleStyle_description" = "AppleStyle theme di Eps,
Installa in /EFI/BOOT/themes/AppleStyle.";

"mrengles_title" = "mrengles";
"mrengles_description" = "mrengles theme di mrengles,
Installa in /EFI/BOOT/themes/mrengles.";

"buttons_title" = "buttons";
"buttons_description" = "Tema Buttons di Trauma,
Installa in /EFI/BOOT/themes/buttons.";

"hellfire_title" = "hellfire";
"hellfire_description" = "Tema Hellfire di illevelll,
Installa in /EFI/BOOT/themes/hellfire.";

"metal_title" = "metal";
"metal_description" = "Il tema original metal di Slice,
Installa in /EFI/BOOT/themes/metal.";

"simple_gray_title" = "simple_gray";
"simple_gray_description" = "Tema Simple_gray di hijeane,
Installa in /EFI/BOOT/themes/simple_gray.";

"wooden_title" = "wooden";
"wooden_description" = "Tema Wooden di iROOTa,
Installa in /EFI/BOOT/themes/wooden.";

// ----------------------------------------------------------------------------
